org-content/hugo.org
#+STARTUP: content
#+options: author:nil
#+HUGO_BASE_DIR: ../
#+hugo_level_offset: 0

** DONE Summer 2020 Internship at Harvard High Performance Computing :internship:locust:@Retrospectives:
CLOSED: [2020-12-05]
:PROPERTIES:
:EXPORT_HUGO_BUNDLE: summer-2020-internship-at-harvard-high-performance-computing
:EXPORT_FILE_NAME: index
:END:
:LOGBOOK:
CLOCK: [2020-12-26 Sat 13:28]--[2020-12-26 Sat 13:37] =>  0:09
CLOCK: [2020-12-25 Fri 00:30]--[2020-12-25 Fri 00:40] =>  0:10
CLOCK: [2020-12-24 Thu 09:42]--[2020-12-24 Thu 10:38] =>  0:56
:END:

*** High Level Overview
I intered at Harvard HPC for 12 weeks (High Performance Computing) the summer of 2020.

Due to Covid, the internship was virtual. I was working from my families home in Cambridge, MA.

My work focused on improvements to the Harvard academic cluster. I was lucky to work alongside lots of awesome and brilliant colleagues. :)
*** What Did I Learn

**** Skills
- I learned a lot about performance testing software. Previously i've relied on services like Firebase Hosting which remove some responsibility for performance testing and coding scalability.
- I got very familiar with linux monitoring tools.
- I learned "locust", a python performance testing framework.

**** Lessons
- Make sure to design tests based on what information you are trying to learn from them.
- It's not always worth it to analyze the results of performance tests that assume a higher load than you would ever expect in practice.
- Watch out for threading problems in third party packages.

*** What Did I Get Done

The technical details of my work is pretty well summarized by [[https://ruborcalor.github.io/Academic-Cluster-Presentation/][this presentation]] I gave at the end of the internship (I didn't record it unfortunately).

Here is an overview of the things I was most proud of accomplishing:
- After using performance testing to identify bottlenecks in the user account creation pipeline backend, I was able to modify it and improve processing speed by 15 times (Python, Bash).
- I coded [[https://gist.github.com/Ruborcalor/86300f7f1a17f75c34b10b778c83962d][web server performance tests]] which exposed unexpectedly high load averages on web server hosts, and found a way to reduce that load by 70% (Locust).
- I built a [[https://github.com/Ruborcalor/hpc-status-app][dashboard]] that enables non technical users to understand the complex Harvard super computer status (React, Passenger).
- Shared my load testing script and findings with the OSC OnDemand community: [[https://discourse.osc.edu/t/load-testing-ood/986/6][post]].

*** COMMENT Memorable Events

**** Code Test Python Fail
Python dictionary syntax tripped me up.

**** Giving Tech Talk

**** Posting on Discourse

**** =event_mpm= threading issues

*** Thanks
This experience would not have been possible without the many awesome colleagues I got to work alongside.
- Special thanks Francesco for being such a great mentor this past summer and instilling me with a sense of confidence and responsibility. I wouldn't have grown and learned as much as I did without your constant feedback.
- Special thanks Raminder for having me back to intern this past summer and believing in me.

*** COMMENT Comments

Nobody is interested in this level of detail. I will link the final presentation for the people interested in the details. What is the point?
- To identify lessons
- To give a high level overview of what I was up to over the summer

Who wants to read this? I don't. It's more a personal reflection. This thought was prompted by the idea of putting this under the "stories" category. I shouldn't do this, because I'm not framing it as a story. I'll have to make another category for reflections/retrospectives.
